blog-posts/2008-01-18-outlining-your-notes-with-org.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Outlining Your Notes with Org</title>
<!-- 2015-01-07 Wed 14:49 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link href='http://fonts.googleapis.com/css?family=Open+Sans' rel='stylesheet' type='text/css'></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Outlining Your Notes with Org</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Understanding Org</a></li>
<li><a href="#sec-2">Working with Outlines</a></li>
<li><a href="#sec-3">Brainstorming</a></li>
<li><a href="#sec-4">Getting a Sense of Progress</a></li>
<li><a href="#sec-5">Searching Your Notes</a></li>
<li><a href="#sec-6">Hyperlinks</a></li>
<li><a href="#sec-7">Publishing Your Notes</a></li>
<li><a href="#sec-8">Integrating Remember with Org</a></li>
</ul>
</div>
</div>
<p>
January 18th, 2008 -
<a href="http://sachachua.com/blog/p/4688"><a href="http://sachachua.com/blog/p/4688">http://sachachua.com/blog/p/4688</a></a>
</p>

<p>
Large documents are almost impossible to write without outlines. There's
just too much to fit in your head. Outlines help you work with a
structure, so that you can see the big picture and how sections fit
together. Outlines are also surprisingly useful when brainstorming. You
can work with varying levels of detail, starting with a high-level
overview and successively refining it, or starting with the details and
then letting the structure emerge as you organize those details into
groups.
</p>

<p>
Emacs has one of the most powerful outline editors I've come across.
Although word processors like Microsoft Word and OpenOffice.org Writer
support outlines too, Emacs has a gazillion keyboard shortcuts, and once
you get the hang of them, you'll want them in other applications as
well. In addition, working in Emacs tends to force you to focus on the
content instead of spending time fiddling with the formatting. Whether
you're writing personal notes or working on a document that's due
tomorrow, this is a good thing.
</p>

<p>
In this section, you'll learn how to outline a document using Org.
You'll be able to create headings, sub-headings, and text notes. You'll
also learn how to manage outline items by promoting, demoting, and
rearranging them.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Understanding Org</h2>
<div class="outline-text-2" id="text-1">
<p>
Org is primarily a personal information manager that keeps track of your
tasks and schedule, and you'll learn more about those features in
chapters 8 and 9. However, Org also has powerful outline-management
tools, which is why I recommend it to people who want to write and
organize outlined notes.
</p>

<p>
The structure of an Org file is simple: a plain text file with
headlines, text, and some additional information such as tags and
timestamps. A headline is any line that stars with a series of
asterisks. The more asterisks there are, the deeper the headline is. A
second-level headline is the child of the first-level headline before
it, and so on. For example:
</p>

<pre class="example">
* This is a first-level headline
Some text under that headline
** This is a second-level headline
Some more text here
*** This is a third-level headline
*** This is another third-level headline
** This is a second-level headline
</pre>

<p>
Because Org uses plain text, it's easy to back up or process using
scripts. Org's sophistication comes from keyboard shortcuts that allow
you to quickly manipulate headlines, hide and show outline subtrees, and
search for information.
</p>

<p>
GNU Emacs 22 includes Org. To automatically enable Org mode for all
files with the .org extension, add the following to your ~/.emacs:
</p>

<pre class="example">
(require 'org)
(add-to-list 'auto-mode-alist '("\\.org$" . org-mode))
</pre>

<p>
To change to org-mode manually, use M-x org-mode while viewing a file.
To enable Org on a per-file basis, add
</p>

<pre class="example">
-*- mode: org -*-
</pre>

<p>
to the first line of the files that you would like to associate with
Org.
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Working with Outlines</h2>
<div class="outline-text-2" id="text-2">
<p>
You can keep your notes in more than one Org file, but let's start by
creating ~/notes.org. Open ~/notes.org, which will automatically be
associated with Org Mode. Type in the general structure of your
document. You can type in something like this:
</p>

<pre class="example">
* Introduction
* ...
</pre>

<p>
You can also use M-RET (org-meta-return) to create a new headline at the
same level as the one above it, or a first-level headline if the
document doesn't have headlines yet.
</p>

<p>
Create different sections for your work. For example, a thesis might be
divided into introduction, review of related literature, description of
study, methodology, results and analysis, and conclusions and
recommendations. You can type in the starting asterisks yourself, or you
can use M-RET (org-meta-return) to create headings one after the other.
</p>

<p>
Now that you have the basic structure, start refining it. Go to the
first section and use a command like C-o (open-line) to create blank
space. Add another headline, but this time, make it a second-level
headline under the first. You can do that by either typing in two
asterisks or by using M-RET (org-meta-return, which calls
org-insert-heading) and then M-right (org-metaright, which calls
org-do-demote). Then use M-RET (org-meta-return; org-insert-heading) for
the other items, or type them in yourself. Repeat this for other
sections, and go into as much detail as you want.
</p>

<p>
What if you want to reorganize your outline? For example, what if you
realized you'd accidentally put your conclusions before the
introduction? You could either cut and paste it using Emacs shortcuts,
or you can use Org's outline management functions. The following
keyboard shortcuts are handy:
</p>

<p>
Action
</p>

<p>
Command
</p>

<p>
Shortcut
</p>

<p>
Alternative
</p>

<p>
Move a subtree up
</p>

<p>
org-metaup / org-move-subtree-up
</p>

<p>
M-up
</p>

<p>
C-c C-x u
</p>

<p>
Move a subtree down
</p>

<p>
org-metadown / org-move-subtree-down
</p>

<p>
M-down
</p>

<p>
C-c C-x d
</p>

<p>
Demote a subtree
</p>

<p>
org-shiftmetaright / org-demote-subtree
</p>

<p>
S-M-right
</p>

<p>
C-c C-x r
</p>

<p>
Promote a subtree
</p>

<p>
org-shiftmetaleft / org-promote-subtree
</p>

<p>
S-M-left
</p>

<p>
C-c C-x l
</p>

<p>
Demote a headline
</p>

<p>
org-metaright / org-do-demote
</p>

<p>
M-right
</p>

<p>
C-c C-x &lt;right&gt;
</p>

<p>
Promote a headline
</p>

<p>
org-metaleft / org-do-promote
</p>

<p>
M-left
</p>

<p>
C-c C-x &lt;left&gt;
</p>

<p>
Collapse or expand a subtree
</p>

<p>
org-cycle (while on headline)
</p>

<p>
TAB
</p>

<p>
Collapse or expand everything
</p>

<p>
org-shifttab (org-cycle)
</p>

<p>
S-TAB
</p>

<p>
C-u TAB
</p>

<p>
Use these commands to help you reorganize your outline as you create a
skeleton for your document. These commands make it easy to change your
mind about the content or order of sections. You might find it easier to
sketch a rough outline first, then gradually fill in more and more
detail. On the other hand, you might find it easier to pick one section
and keep drilling it down until you have headlines some seven levels
deep. When you reach that point, all you need to do is add punctuation
and words like "and" or "but" between every other outline item, and
you're done!
</p>

<p>
Well, no, not likely. You'll probably get stuck somewhere, so here are
some tips for keeping yourself going when you're working on a large
document in Org: brainstorming and getting a sense of your progress.
</p>
</div>
</div>
