blog-posts/2008-01-18-outlining-your-notes-with-org.html
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Brainstorming</h2>
<div class="outline-text-2" id="text-3">
<p>
Brainstorming is a great way to break your writer's block or to generate
lots of possibilities. The key idea is to come up with as many ideas as
you can, and write them all down before you start evaluating them.
</p>

<p>
I usually switch to paper for mindmapping and brainstorming because
paper helps me think in a more colorful and non-linear way. However, it
can be hard to manage large mindmaps on paper, because you can't
reorganize nodes easily. Despite its text-heavy interface, Org is one of
the best mindmapping tools I've come across. Because it's built into
Emacs, everything can be done through keyboard shortcuts.
</p>

<p>
When you're brainstorming, you might like working from two different
directions. Sometimes it's easier to start with an outline and to add
more and more detail. Other times, you may want to jot quick ideas and
then organize them into groups that make sense. Org provides support for
both ways of working.
</p>

<p>
Brainstorming bottom-up is similar to David Allen's Getting Things Done
method in that separating collection from organization is a good idea.
That is, get the ideas out of your head first before you spend time
trying to figure out the best way to organize them. To get things out of
your head quickly, collect your ideas by using the M-RET
(org-meta-return) to create a new heading, typing in your idea, and
using M-RET (org-meta-return) to create the next heading. Do this as
many times as needed.
</p>

<p>
One way to encourage yourself to brainstorm lots of ideas is to give
yourself a quota. Charles Cave described this technique in an
<a href="http://members.optusnet.com.au/~charles57/GTD/Natural_Project_Planning.html">article
on org-mode</a>, and it's a great way to use structure to prompt
creativity. Simply start by adding a number of empty headings (say, 20),
then work towards filling that quota. For example, you might start with
ten blanks for ideas, then gradually fill them in like this:
</p>

<pre class="example">
* Things that make me happy
** Curling up with a good book
** Watching a brilliant sunset
** Giving or getting a big warm hug
** Writing a cool piece of Emacs code
** 
** 
** 
**
** 
**
</pre>

<p>
When all of your ideas are in Org, start organizing them. This is where
you move ideas around using M-S-up (org-shiftmetaup) and M-S-down
(org-shift-metadown), which call org-move-subtree-up and
org-move-subtree-down. This is also a good time to use headings to group
things together.
</p>
</div>
</div>
