blog-posts/2008-01-18-outlining-your-notes-with-org.html
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Getting a Sense of Progress</h2>
<div class="outline-text-2" id="text-4">
<p>
You've brainstormed. You've started writing your notes. And if you're
working on a large document, you might lose steam at some point along
the way. For example, while working on this book, I often find myself
intimidated by just how much there is to write about Emacs. It helps to
have a sense of progress such as the number of words written or the
number of sections completed. To see a word count that updates every
second, add this code to your ~/.emacs:
</p>

<pre class="example">
(defvar count-words-buffer
  nil
  "*Number of words in the buffer.")

(defun wicked/update-wc ()
  (interactive)
  (setq count-words-buffer (number-to-string (count-words-buffer)))
  (force-mode-line-update))

; only setup timer once
(unless count-words-buffer
  ;; seed count-words-paragraph
  ;; create timer to keep count-words-paragraph updated
  (run-with-idle-timer 1 t 'wicked/update-wc))

;; add count words paragraph the mode line
(unless (memq 'count-words-buffer global-mode-string)
  (add-to-list 'global-mode-string "words: " t)
  (add-to-list 'global-mode-string 'count-words-buffer t)) 

;; count number of words in current paragraph
(defun count-words-buffer ()
  "Count the number of words in the current paragraph."
  (interactive)
  (save-excursion
    (goto-char (point-min))
    (let ((count 0))
      (while (not (eobp))
    (forward-word 1)
        (setq count (1+ count)))
      count)))
</pre>

<p>
The best way I've found to track my progress in terms of sections is to
use a checklist. For example, the collapsed view for this section looks
like this:
</p>

<pre class="example">
** Outline Notes with Org [7/9]    ;; (1)
*** [X] Outlining Your Notes...    ;; (2)
*** [X] Understanding Org...
*** [X] Working with Outlines...
*** [X] Brainstorming...
*** [ ] Getting a Sense of Progress... ;; (3)
*** [X] Searching Your Notes...
*** [X] Hyperlinks...
*** [X] Publishing Your Notes...
*** [ ] Integrating Remember with Org
</pre>

<ul class="org-ul">
<li>(1): <code>[7/9]</code> shows that I've completed 7 of 9 parts.
</li>
<li>(2): [X] indicates finished parts.
</li>
<li>(3): [ ] indicates parts I still need to do.
</li>
</ul>

<p>
This is based on the checklist feature in Org. However, the standard
feature works only with lists like this:
</p>

<pre class="example">
*** Items [1/3]
- [X] Item 1
- [ ] Item 2
- [ ] Item 3
</pre>

<p>
Add the following code to your ~/.emacs in order to make the function
work with headlines:
</p>

<pre class="example">
(defun wicked/org-update-checkbox-count (&amp;optional all)
  "Update the checkbox statistics in the current section.
This will find all statistic cookies like [57%] and [6/12] and update
them with the current numbers.  With optional prefix argument ALL,
do this for the whole buffer."
  (interactive "P")
  (save-excursion
    (let* ((buffer-invisibility-spec (org-inhibit-invisibility)) 
       (beg (condition-case nil
            (progn (outline-back-to-heading) (point))
          (error (point-min))))
       (end (move-marker
         (make-marker)
         (progn (or (outline-get-next-sibling) ;; (1)
                (goto-char (point-max)))
            (point))))   
       (re "\\(\\[[0-9]*%\\]\\)\\|\\(\\[[0-9]*/[0-9]*\\]\\)")
       (re-box
        "^[ \t]*\\(*+\\|[-+*]\\|[0-9]+[.)]\\) +\\(\\[[- X]\\]\\)")
       b1 e1 f1 c-on c-off lim (cstat 0))
      (when all
    (goto-char (point-min))
    (or (outline-get-next-sibling) (goto-char (point-max))) ;; (2)
    (setq beg (point) end (point-max)))
      (goto-char beg)
      (while (re-search-forward re end t)
    (setq cstat (1+ cstat)
          b1 (match-beginning 0)
          e1 (match-end 0)
          f1 (match-beginning 1)
          lim (cond
           ((org-on-heading-p)
            (or (outline-get-next-sibling) ;; (3)
            (goto-char (point-max)))
            (point))
           ((org-at-item-p) (org-end-of-item) (point))
           (t nil))
          c-on 0 c-off 0)
    (goto-char e1)
    (when lim
      (while (re-search-forward re-box lim t)
        (if (member (match-string 2) '("[ ]" "[-]"))
        (setq c-off (1+ c-off))
          (setq c-on (1+ c-on))))
      (goto-char b1)
      (insert (if f1
              (format "[%d%%]" (/ (* 100 c-on)
                      (max 1 (+ c-on c-off))))
            (format "[%d/%d]" c-on (+ c-on c-off))))
      (and (looking-at "\\[.*?\\]")
           (replace-match ""))))
      (when (interactive-p)
    (message "Checkbox statistics updated %s (%d places)"
         (if all "in entire file" "in current outline entry")
         cstat)))))
(defadvice org-update-checkbox-count (around wicked activate)
  "Fix the built-in checkbox count to understand headlines."
  (setq ad-return-value
    (wicked/org-update-checkbox-count (ad-get-arg 1))))
</pre>

<p>
Now add [ ] or [X] to the lower-level headlines you want to track. Add
<code>[/]</code> to the end of the higher-level headline containing those headlines.
Type C-c # (org-update-checkbox-count) to update the count for the
current headline, or C-u C-c C-# (org-update-checkbox-count) to update
all checkbox counts in the whole buffer.
</p>

<p>
If you want to see the percentage of completed items, use <code>[%]</code> instead of
<code>[/]</code>. I find 7/9 to be easier to understand than 71%, but fractions might
work better for other cases.
</p>

<p>
Okay, you've written a lot. How do you find information again?
</p>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Searching Your Notes</h2>
<div class="outline-text-2" id="text-5">
<p>
When you're writing your notes, you might need to refer to something
you've written. You may find it helpful to split your screen in two with
C-x 3 (split-window-horizontally) or C-x 2 (split-window-vertically). To
switch to another window, type C-x o (other-window) or click on the
window. To return to just one window, use C-x 1 (delete-other-windows)
to focus on just the current window, or C-x 0 (delete-window) to get rid
of the current window.
</p>

<p>
Now that you've split your screen, how do you quickly search through
your notes? C-s (isearch-forward) and C-r (isearch-backward) are two of
the most useful Emacs keyboard shortcuts you'll ever learn. Use them to
not only interactively search your Org file, but also to quickly jump to
sections. For example, I often search for headlines by typing * and the
first word. Org searches collapsed sections, so you don't need to open
everything before searching.
</p>

<p>
To search using Org's outline structure, use C-c / r (org-sparse-tree,
regexp), which will show only entries matching a regular expression. For
more information about regular expressions, read the Emacs info manual
entry on Regexps. Here are a few examples:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left"><b>To find</b></td>
<td class="left"><b>Search for</b></td>
</tr>

<tr>
<td class="left">All entries containing "cat"</td>
<td class="left">cat</td>
</tr>

<tr>
<td class="left">All entries that contain "cat" as a word by itself (example: "cat," but not "catch")</td>
<td class="left">\&lt;cat\&gt;</td>
</tr>

<tr>
<td class="left">All entries that contain 2006, 2007, or 2008</td>
<td class="left">200<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup></td>
</tr>
</tbody>
</table>
</div>
</div>
