blog-posts/2008-01-18-outlining-your-notes-with-org.html
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Hyperlinks</h2>
<div class="outline-text-2" id="text-6">
<p>
If you find yourself frequently searching for some sections, you might
want to create hyperlinks to them. For example, if you're using one file
for all of your project notes instead of splitting it up into one file
per project, then you probably want a list of projects at the beginning
of the file so that you can jump to each project quickly.
</p>

<p>
You can also use hyperlinks to keep track of your current working
position. For example, if you're working on a long document and you want
to keep your place, create a link anchor like <a id="TODO" name="TODO"></a> at the point
where you're editing, and add a link like <a href="#TODO">6</a> at the beginning of
your file.
</p>

<p>
You can create a hyperlink to a text search by putting the keywords
between two pairs of square brackets, like this:
</p>

<pre class="example">
See [[things that make me happy]]
</pre>

<p>
You can open the link by moving the point to the link and typing C-c C-o
(org-open-at-point). You can also click on the link to open it. Org will
then search for text matching the query. If Org doesn't find an exact
match, it tries to match similar text, such as "Things that make me
really really happy".
</p>

<p>
If you find that the link does not go where you want it to go, you can
limit the text search. For example, if you want to link to a headline
and you know the headline will be unique, you can add an asterisk at the
beginning of the link text in order to limit the search to headlines.
For example, given the following text:
</p>

<pre class="example">
In this file, I'll write notes on the things that make me happy. (1)
If I ever need a spot of cheering up, I'll know just what to do! 

** Things that make me happy (2) 
*** ...

Example 
Link 1: [[things that make me happy]] 

Link 2: [[*things that make me happy]]
</pre>

<p>
Link 1 would lead to (1), and Link 2 would lead to (2).
</p>

<p>
To define a link anchor, put the text in double angled brackets like
this:
</p>

<pre class="example">
&lt;&lt;things that make me happy&gt;&gt;
</pre>

<p>
A link like <i>things that make me happy</i> would then link to that
instead of other occurances of the text.
</p>

<p>
You can define keywords that will be automatically hyperlinked
throughout the file by using radio targets. For example, if you're
writing a jargon-filled document and you frequently need to refer to the
definitions, it may help to make a glossary of terms such as "regexp"
and "radio target", and then define them in a glossary section at the
end of the file, like this:
</p>

<pre class="example">
*** glossary
&lt;&lt;&lt;radio target&gt;&gt;&gt; A word or phrase that is automatically hyperlinked whenever it appears. 
&lt;&lt;&lt;regexp&gt;&gt;&gt; A regular expression. See the Emacs info manual.
</pre>

<p>
Radio targets are automatically enabled when an Org file is opened in
Emacs. If you've just added a radio target, enable it by moving the
point to the anchor and pressing C-c C-c (org-ctrl-c-ctrl-c). This turns
all instances of the text into hyperlinks that point to the radio
target.
</p>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">Publishing Your Notes</h2>
<div class="outline-text-2" id="text-7">
<p>
You can keep your notes as a plain text file, or you can publish them as
HTML or LaTeX. HTML seems to be the easiest way to let non-Emacs users
read your notes, as a large text file without pretty colors can be hard
to read.
</p>

<p>
To export a file to any of the formats that Org understands by default,
type C-c C-e (org-export). You can then type ‘h' (org-export-as-html) to
export it as HTML for websites. You can also type ‘l'
(org-export-as-latex) to export it to LaTeX, a scientific typesetting
language, which can then be published as PDF or PS. Another way to
convert it to PDF is to export it as HTML, open it in OpenOffice.org
Writer, and use the Export to PDF feature. You can also open HTML
documents in other popular word processors to convert them to other
supported formats.
</p>

<p>
By default, Org exports all the content in the current file. To limit it
only to the visible content, use C-c C-e v (org-export-visible) followed
by either ‘h' for HTML or ‘l' for LaTeX.
</p>

<p>
If you share your notes, you may want to export an HTML version every
time you save an Org file. Here is a quick and dirty way to publish all
Org files to HTML every time you save them:
</p>

<pre class="example">
(defun wicked/org-publish-files-maybe ()
  "Publish this file."
  (org-export-as-html-batch)
  nil)
(add-hook 'org-mode-hook  ;; (1)
 (lambda () 
  (add-hook (make-local-variable 'after-save-hook) ;; (2)
            'wicked/org-publish-files-maybe)))
</pre>

<p>
(Update: Feb 22 2011: Thanks to Neilen for the fix!)
</p>

<ul class="org-ul">
<li>(1) Every time a buffer is set to Org mode&#x2026;
</li>
<li>(2) Add a function that publishes the file every time that file is
saved.
</li>
</ul>

<p>
What if most of your files are private, but you want to publish only a
few of them? To control this, let's add a new special keyword
"#+PUBLISH" to the beginning of the files that you want to be
automatically published. Replace the previous code in your ~/.emacs with
this:
</p>

<pre class="example">
(defun wicked/org-publish-files-maybe ()
  "Publish this file if it contains the #+PUBLISH: keyword"
  (save-excursion
   (save-restriction
    (widen)
    (goto-char (point-min))
    (when (re-search-forward 
           "^#?[ \t]*\\+\\(PUBLISH\\)"
           nil t) 
     (org-export-as-html-batch)   
     nil))))

(add-hook 'org-mode-hook
 (lambda ()
  (add-hook (make-local-variable 'after-save-hook)
            'wicked/org-publish-files-maybe)))
</pre>

<p>
and add #+PUBLISH on a line by itself to your ~/notes.org file, like
this:
</p>

<pre class="example">
#+PUBLISH
* Things that make me happy
</pre>

<p>
When you save any Org file that contains the keyword, the corresponding
HTML page will also be created. You can then use a program like rsync or
scp to copy the file to a webserver, or you can copy it to a shared
directory.
</p>
</div>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">Integrating Remember with Org</h2>
<div class="outline-text-2" id="text-8">
<p>
You can use Remember to collect notes that you will later integrate into
your outline. Add the following code to your ~/.emacs to set it up:
</p>

<pre class="example">
(global-set-key (kbd "C-c r") 'remember)    ;; (1)
(add-hook 'remember-mode-hook 'org-remember-apply-template) ;; (2)
(setq org-remember-templates  
      '((?n "* %U %?\n\n  %i\n  %a" "~/notes.org")))  ;; (3)
(setq remember-annotation-functions '(org-remember-annotation)) ;; (4)
(setq remember-handler-functions '(org-remember-handler)) ;; (5)
</pre>

<ul class="org-ul">
<li>1: Handy keyboard shortcut for (r)emember
</li>
<li>2: Creates a template for (n)otes
</li>
<li>3: Create a note template which saves the note to ~/notes.org, or
whichever Org file you want to use
</li>
<li>4: Creates org-compatible context links
</li>
<li>5: Saves remembered notes to an Org file
</li>
</ul>

<p>
With this code, you can type C-c r n (remember, Notes template) to pop
up a buffer (usually containing a link to whatever you were looking at),
write your note, and type C-c C-c (remember-buffer) to save the note and
close the buffer.
</p>

<p>
You can use this to store snippets in your notes file, or to quickly
capture an idea that comes up when you're doing something else.
</p>

<p>
Now you know how to sketch an outline, reorganize it, fill it in,
brainstorm, stay motivated, and publish your notes. I look forward to
reading what you have to share!
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p>DEFINITION NOT FOUND.</p></div>


</div>
</div></div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
